{
  "introduction": "At CASA, we are committed to protecting your privacy. This Privacy Policy outlines how we collect, use, store, and protect your personal information when you use our platform.",
  "sections": [
    {
      "title": "Information We Collect",
      "content": [
        {
          "personal-information": "Name, phone number, shipping address, payment details, and other contact information."
        },
        {
          "browsing-data": "Your interactions on the platform, such as products viewed, pages visited, and time spent on the app or website."
        },
        {
          "device-information": "IP address, browser type, device type, and operating system."
        },
        {
          "cookies-and-tracking-technologies": "We use cookies to improve your experience and analyze platform performance."
        }
      ]
    },
    {
      "title": "How We Use Your Information",
      "content": [
        {
          "shopping-experience": "To provide, personalize, and improve your shopping experience."
        },
        {
          "transactions-and-deliveries": "To process transactions, send order confirmations, and handle deliveries."
        },
        {
          "recommendations": "To offer product recommendations based on your behavior."
        },
        {
          "communications": "To communicate promotional offers, updates, and news (only with your consent)."
        },
        {
          "fraud-prevention": "To prevent fraud and ensure platform security."
        }
      ]
    },
    {
      "title": "How We Share Your Information",
      "content": [
        {
          "no-selling": "We do not sell your personal data to third parties. However, we may share your information with:"
        },
        {
          "service-providers": "For payment processing, delivery, and marketing services."
        },
        {
          "legal-authorities": "When required by law or to protect CASA’s rights and safety."
        },
        {
          "business-partners": "If you engage with third-party brands or products showcased on CASA."
        }
      ]
    },
    {
      "title": "Your Data Rights",
      "content": [
        { "access": "Request a copy of the data we hold about you." },
        {
          "correction": "Request corrections to inaccurate or incomplete information."
        },
        {
          "deletion": "Request the deletion of your data, subject to legal obligations."
        },
        {
          "opt-out": "Unsubscribe from marketing emails and opt out of data tracking."
        }
      ],
      "note": "To exercise these rights, please reach out to us through the contact options available on our platform."
    },
    {
      "title": "Data Storage and Security",
      "content": [
        {
          "security-measures": "We take appropriate technical and organizational measures to secure your data. However, no system is completely secure, and we cannot guarantee absolute data protection."
        },
        {
          "data-retention": "We retain personal information as long as necessary for the purposes outlined in this policy or as required by law."
        }
      ]
    },
    {
      "title": "Cookies and Tracking Technologies",
      "content": [
        { "improve-experience": "Improve your user experience." },
        { "traffic-analysis": "Analyze website traffic and usage patterns." },
        {
          "personalized-recommendations": "Show personalized recommendations and advertisements (if applicable)."
        },
        {
          "cookie-management": "You can manage your cookie preferences through your browser settings."
        }
      ]
    },
    {
      "title": "Third-Party Links",
      "content": [
        {
          "external-sites": "Our platform may contain links to third-party websites. We are not responsible for their privacy practices, so we encourage you to review their policies when visiting external sites."
        }
      ]
    },
    {
      "title": "Children’s Privacy",
      "content": [
        {
          "age-restriction": "CASA is not intended for children under the age of 13."
        },
        {
          "data-deletion": "We do not knowingly collect personal information from children. If we discover that we have received information from a child, we will delete it promptly."
        }
      ]
    },
    {
      "title": "Changes to This Privacy Policy",
      "content": [
        {
          "policy-updates": "We may update this Privacy Policy from time to time."
        },
        {
          "change-notifications": "Any changes will be posted on this page, and we will notify you if the changes are significant."
        }
      ]
    },
    {
      "title": "Contact Us",
      "note": "For any questions or concerns about our privacy practices, please use the contact options available on our platform.",
      "content": []
    }
  ]
}
